app/controllers/history_controller.rb

SELECT "histories".* FROM "histories"
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (1)
---
  def index
    histories = History.includes(:tags).all

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "histories" ("name", "latitude", "longitude", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    file = params[:history][:audio] #recover file to upload
    if !file.nil?
      m_params = params
      m_params.delete("audio") #delete uncessary hash

      tag = Tag.find(params["history"]["tag"])

      file_name = Time.now.strftime("%Y_%d_%m_%H_%M_%S-%Z") + params["history"]["name"]
      file_path = Rails.root.join('public', 'uploads', file_name)

      m_params["history"]["url"] = "https://s3-us-west-2.amazonaws.com/creatn/" + file_name +".mp3"

      if upload(file, file_path, file_name )
        history = History.new(history_params(m_params))
        history.tags.push(tag);

SELECT  "histories".* FROM "histories" WHERE "histories"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "histories" SET "likes" = $1, "updated_at" = $2 WHERE "histories"."id" = $3  [["likes", 1], ["updated_at", "2016-08-21 03:20:50.712180"], ["id", 1]]
---
  def add_like
    history = History.find(params[:history][:id])
    if !history.nil?
      history.likes = history.likes + 1

      if history.save