app/controllers/location_controller.rb

  def search
    user_info = user_location_params

    if params[:user_info][:purged] == "1"
      histories = History.where('likes > 5').includes(:tags)
    else
      histories = History.includes(:tags).all
---
SELECT "histories".* FROM "histories" WHERE (likes > 5)
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (1)
SELECT "histories".* FROM "histories"