app/controllers/tag_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    tags = Tag.all()